# SetWorkingPlaneN

## Description
Set the active working plane.

```pascal
PROCEDURE SetWorkingPlaneN(
				centerPt : REAL;
				normal   : REAL;
				uVec     : REAL);
```

```python

def vs.SetWorkingPlaneN(centerPt, normal, uVec):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|centerPt|REAL|Location of the working plane.|
|normal|REAL|Normal vector of the working plane.|
|uVec|REAL|The U Vector of the plane.|

## Version
Availability: from Vectorworks 2011
## Category
* Utility